STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/demo_application.c
/**
  ******************************************************************************
  * @file    demo_application.c
  * @author  MCD Application Team
  * @brief   UCPD demo application code
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics International N.V.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "usbpd_core.h"
#include "usbpd_dpm_core.h"
#include "usbpd_dpm_conf.h"
#include "usbpd_dpm_user.h"
#include "usbpd_pwr_if.h"
#include "usbpd_devices_conf.h"
#include "logo_STM32_L5.h"
#include "demo_application.h"
#include "string.h"
#include "stdio.h"
#if defined(_RTOS)
#include "cmsis_os.h"
#endif
#if defined(_TRACE)
#include "usbpd_trace.h"
#endif
#include "basic_gui.h"
#if defined(_GUI_INTERFACE)
#include "gui_api.h"
#endif /* _GUI_INTERFACE */

/** @addtogroup STM32_USBPD_APPLICATION
  * @{
  */

/** @addtogroup STM32_USBPD_APPLICATION_DEMO
  * @{
  */

/* Exported variables --------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define LCD_ALARMBOX_MESSAGES_MAX         30u

/* LCD instance */
#define LCD_INSTANCE 0
#define DEMO_MAIN_LCD                      LCD_INSTANCE

/* Format of the different kind of message */
/*   - 31-28  4 bit for the message type   */
#define DEMO_MSG_TYPE_POS                 28u
#define DEMO_MSG_TYPE_MSK                 (0xFu << DEMO_MSG_TYPE_POS)
#define DEMO_MSG_MMI                      (0u   << DEMO_MSG_TYPE_POS)
#define DEMO_MSG_CAD                      (1u   << DEMO_MSG_TYPE_POS)
#define DEMO_MSG_PENOTIFY                 (2u   << DEMO_MSG_TYPE_POS)

/*  MMI
     - 15-0 id event
#define DEMO_MMI_ACTION_Pos                   (0U)
#define DEMO_MMI_ACTION_Msk                   (0xFF << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION                       DPM_USER_ACTION_Msk
#define DEMO_MMI_ACTION_NONE                  (0u)
#define DEMO_MMI_ACTION_TAMPER_PRESS          (1u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_RIGHT_PRESS           (2u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_LEFT_PRESS            (3u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_UP_PRESS              (4u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_DOWN_PRESS            (5u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_SEL_PRESS             (6u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_DISPLAY_VBUS_IBUS     (7u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_JOY_PRESS             (8u << DEMO_MMI_ACTION_Pos)
*/
/*  CAD
     - 27-26 2 bit for CC Pin
     - 25-24 2 bit port num
     - 15-00 16 bit CAD event
*/
#define DEMO_CAD_CC_NUM_Pos               (26u)
#define DEMO_CAD_CC_NUM_Msk               (0x3u << DEMO_CAD_CC_NUM_Pos)
#define DEMO_CAD_CC_NUM_NONE              (0u   << DEMO_CAD_CC_NUM_Pos)
#define DEMO_CAD_CC_NUM_CC1               (1u   << DEMO_CAD_CC_NUM_Pos)
#define DEMO_CAD_CC_NUM_CC2               (2u   << DEMO_CAD_CC_NUM_Pos)

#define DEMO_CAD_PORT_NUM_Pos             (24u)
#define DEMO_CAD_PORT_NUM_Msk             (0x3u << DEMO_CAD_PORT_NUM_Pos)
#define DEMO_CAD_PORT_NUM_0               (0x0u << DEMO_CAD_PORT_NUM_Pos)
#define DEMO_CAD_PORT_NUM_1               (0x1u << DEMO_CAD_PORT_NUM_Pos)

#define DEMO_CAD_STATE_Pos                (0u)
#define DEMO_CAD_STATE_Msk                (0xFFu << DEMO_CAD_STATE_Pos)

/*  PE
     - 27-26 2 bit none
     - 25-24 2 bit port num
     - 15-00 16 bit PE event
*/
#define DEMO_PE_PORT_NUM_Pos             (24u)
#define DEMO_PE_PORT_NUM_Msk             (0x3u << DEMO_PE_PORT_NUM_Pos)
#define DEMO_PE_PORT_NUM_0               (0x0u << DEMO_PE_PORT_NUM_Pos)
#define DEMO_PE_PORT_NUM_1               (0x1u << DEMO_PE_PORT_NUM_Pos)

#define DEMO_PE_STATE_Pos                (0u)
#define DEMO_PE_STATE_Msk                (0xFFu << DEMO_PE_STATE_Pos)

#define MAX_LINE_PDO      4u
#define MAX_LINE_COMMAND  4u
#define MAX_LINE_EXTCAPA  5u

/* DEMO Error messages max size
*/
#define DEMO_ERROR_MAX_MSG_SIZE  25U

#if defined(_RTOS)
#if (osCMSIS < 0x20000U)
#define DEMO_STACK_SIZE_ADDON_FOR_CMSIS              1
#else
#define DEMO_STACK_SIZE_ADDON_FOR_CMSIS              3
#endif /* osCMSIS < 0x20000U */

#define FREERTOS_DEMO_LCD_PRIORITY              osPriorityLow
#define FREERTOS_DEMO_LCD_STACK_SIZE            (600 * DEMO_STACK_SIZE_ADDON_FOR_CMSIS)
#endif /*_RTOS*/

typedef enum {
  MENU_EMPTY,
  MENU_COMMAND,
  MENU_SOURCECAPA_RECEIVED,
  MENU_SINKCAPA_RECEIVED,
  MENU_EXTCAPA_RECEIVED,
  MENU_SNKEXTCAPA_RECEIVED,
  MENU_BUILD,
  MENU_CABLE,
  MENU_MAX
} DEMO_MENU;

typedef enum {
  COMMAND_NONE,
  COMMAND_HARDRESET,
  COMMAND_CONTROLMSG_GOTOMIN,
  COMMAND_CONTROLMSG_GET_SRC_CAP,
  COMMAND_CONTROLMSG_GET_SNK_CAP,
  COMMAND_CONTROLMSG_DR_SWAP,
  COMMAND_CONTROLMSG_PR_SWAP,
  COMMAND_CONTROLMSG_VCONN_SWAP,
  COMMAND_CONTROLMSG_SOFT_RESET,
#if defined(_VDM)
  COMMAND_REQUEST_VDM_DISCOVERY,
#endif
#if defined(USBPD_REV30_SUPPORT)
  COMMAND_CONTROLMSG_GET_SRC_CAPEXT,
  COMMAND_CONTROLMSG_GET_STATUS,
#endif /* USBPD_REV30_SUPPORT */
  COMMAND_CONTROLMSG_GET_SNK_CAPEXT,
} DEMO_COMMAND;

enum {
  COMMANDROLE_SRC   = 1,
  COMMANDROLE_SNK   = 2,
  COMMANDROLE_DRP   = 4,
  COMMANDROLE_VCONN = 8
};

typedef struct
{
  uint8_t commandid;
  uint8_t commandstr[23];
  uint8_t commandconfig;
} typedef_COMMANDE;

/* Private macro -------------------------------------------------------------*/
#if defined(_VDM)
#define DEMO_COMMAND_VDM  1u
#else
#define DEMO_COMMAND_VDM  0u
#endif
#if defined(USBPD_REV30_SUPPORT)
#define DEMO_COMMAND_PD30_SNK_CAPA_EXT  1u
#define DEMO_COMMAND_PD30_FWUPDATE  0u
#define DEMO_COMMAND_PD30  (2u + DEMO_COMMAND_PD30_SNK_CAPA_EXT + DEMO_COMMAND_PD30_FWUPDATE)
#else
#define DEMO_COMMAND_PD30  0u
#endif

