STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/demo_application.c
  LCDMsgBox = osMessageQueueNew (LCD_ALARMBOX_MESSAGES_MAX, sizeof(uint32_t), NULL);
  if (NULL == osThreadNew(DEMO_Task, &LCDMsgBox, &Demo_Thread_Atrr))
#endif /* osCMSIS < 0x20000U */
  {
    return DEMO_ERROR;
  }
#endif /* _RTOS */

  return DEMO_OK;
}

#if defined(_RTOS)
/**
  * @brief  UserCableDetection reporting events on a specified port from CAD layer.
  * @param  PortNum  The handle of the port
  * @param  State    CAD state
  * @param  Cc       The Communication Channel for the USBPD communication
  * @retval None
  */
void DEMO_PostCADMessage(uint8_t PortNum, USBPD_CAD_EVENT State, CCxPin_TypeDef Cc)
{
  uint32_t event = (DEMO_MSG_CAD |  (Cc << DEMO_CAD_CC_NUM_Pos | (PortNum << DEMO_CAD_PORT_NUM_Pos) | State ));
#if (osCMSIS < 0x20000U)
  (void)osMessagePut(LCDMsgBox, event, 0);
#else
  (void)osMessageQueuePut(LCDMsgBox, &event, 0U, 0U);
#endif /* osCMSIS < 0x20000U */
}

/**
  * @brief  Callback function called by PE to inform DPM about PE event.
  * @param  PortNum   The handle of the port
  * @param  EventVal  @ref USBPD_NotifyEventValue_TypeDef
  * @retval None
  */
void DEMO_PostNotificationMessage(uint8_t PortNum, USBPD_NotifyEventValue_TypeDef EventVal)
{
  uint32_t event = DEMO_MSG_PENOTIFY | PortNum << DEMO_PE_PORT_NUM_Pos | EventVal;
#if (osCMSIS < 0x20000U)
  (void)osMessagePut(LCDMsgBox, event, 0);
#else
  (void)osMessageQueuePut(LCDMsgBox, &event, 0U, 0U);
#endif /* osCMSIS < 0x20000U */
}


/**
  * @brief  Callback function called by PE to inform DPM about PE event.
  * @param  EventVal @ref USBPD_NotifyEventValue_TypeDef
  * @retval None
  */
void DEMO_PostMMIMessage(uint32_t EventVal)
{
  uint32_t event = DEMO_MSG_MMI | EventVal;
  if (joyevent == 0 )
  {
    joyevent = 1;
#if (osCMSIS < 0x20000U)
    (void)osMessagePut(LCDMsgBox, event, 0);
#else
    (void)osMessageQueuePut(LCDMsgBox, &event, 0U, 0U);
#endif /* osCMSIS < 0x20000U */
  }
}
#endif /* _RTOS */

/**
  * @brief  Function used to save cable information .
  * @param  PortNum        The handle of the port
  * @param  pDiscoIdentify Pointer on the VDM discovery identify
  * @retval None
  */
void DEMO_SetCableInfo(uint8_t PortNum, USBPD_DiscoveryIdentity_TypeDef *pDiscoIdentify)
{
  memcpy(&pIdentity, pDiscoIdentify, sizeof(USBPD_DiscoveryIdentity_TypeDef));
}

/**
  * @brief  Display power
  * @retval None
  */
static void Display_power(void)
{
  uint32_t vsense = 0;
  /* No Current sensing on MB1372 : following line is commented as no current indication is displayed in Demo screen */
  /* int32_t isense = 0; */
  char  pstr[20]={0};
  static uint8_t counter = 0;

  counter++;

  if(counter == 5)
  {
    counter = 0;

    GUI_SetFont(&Font12);
    GUI_SetTextColor(GUI_COLOR_ST_PINK);
    GUI_SetBackColor(GUI_COLOR_WHITE);

    /* Port 0 */
    if(DPM_Ports[USBPD_PORT_0].DPM_IsConnected)
    {
      BSP_USBPD_PWR_VBUSGetVoltage(USBPD_PORT_0, &vsense);
      /* No Current sensing on MB1372 : following lines are commented as no current indication is displayed in Demo screen
      BSP_USBPD_PWR_VBUSGetCurrent(USBPD_PORT_0, &isense);
      if(isense < 0)
      {
        isense = -isense;
        sprintf(pstr,"%2lu.%02luV -%1lu.%02luA", (unsigned long)(vsense / 1000), (unsigned long)(vsense % 1000)/10, (unsigned long)(isense/1000), (unsigned long)(isense % 1000)/10);
      }
      else
      {
        sprintf(pstr,"%2lu.%02luV %1lu.%02luA", (unsigned long)(vsense / 1000), (unsigned long)(vsense % 1000)/10, (unsigned long)(isense/1000), (unsigned long)(isense % 1000)/10);
      }
      and replaced by VBUS value only */
      sprintf(pstr,"%2lu.%02luV", (unsigned long)(vsense / 1000), (unsigned long)(vsense % 1000)/10);

      GUI_DisplayStringAt(64, Font12.Height * 4, (uint8_t*)pstr,LEFT_MODE);
    }
    else
    {
      GUI_DisplayStringAt(64, Font12.Height * 4, (uint8_t*)"                ",LEFT_MODE);
    }
  }
}

/**
  * @brief  Display contract info
  * @param  PortNum The handle of the port
  * @retval None
  */
static void Display_contract_port(uint8_t PortNum)
{
  uint32_t pos;

  GUI_SetFont(&Font16);
  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);

  pos = (PortNum == 0)? 54:181;
  pos = pos +  Font16.Width;

  /* PDX */
  if(DPM_Ports[PortNum].DPM_IsConnected)
  {
    if (USBPD_SPECIFICATION_REV3 == DPM_Params[PortNum].PE_SpecRevision)
    {
      GUI_DisplayStringAt(pos, 10+ Font16.Height, (uint8_t*)"PD3", LEFT_MODE);
    }
    else
    {
      GUI_DisplayStringAt(pos, 10+Font16.Height, (uint8_t*)"PD2", LEFT_MODE);
    }

    /* UFP/DFP */
    if (USBPD_PORTDATAROLE_UFP == DPM_Params[PortNum].PE_DataRole)
    {
      GUI_DisplayStringAt(pos + 38, 10+ Font16.Height, (uint8_t*)"UFP", LEFT_MODE);
    }
    else
    {
      GUI_DisplayStringAt(pos + 38, 10 + Font16.Height, (uint8_t*)"DFP", LEFT_MODE);
    }

  }
  else
  {
    GUI_DisplayStringAt(pos, 10+Font16.Height, (uint8_t*)"          ", LEFT_MODE);
  }
}

/**
  * @brief  Display error message
  * @param  PortNum   Port Number
  * @param  ErrorType Demo error type
  * @retval None
  */
void DEMO_Display_Error(uint8_t PortNum, uint8_t ErrorType)
{
  uint8_t *pmsg;

  Display_clear_info();

  GUI_SetFont(&Font16);
  GUI_SetBackColor(GUI_COLOR_RED);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_LIGHT);

  /* Display error info */
  if (ErrorType < DEMO_ERROR_TYPE_MAXNBITEMS)
  {
    pmsg = (uint8_t *) g_tab_error_strings[ErrorType];
    GUI_DisplayStringAt(0, 1 + 6 * Font16.Height, pmsg, CENTER_MODE);
  }
}

/**
  * @brief  Display CC info
  * @param  PortNum The handle of the port
  * @param  cc      CC Pin value
  * @retval None
  */
static void Display_cc_port(uint8_t PortNum, CCxPin_TypeDef cc)
{
  uint32_t pos;

  GUI_SetFont(&Font16);
  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);

  pos = (PortNum == 0)? 54+30:181+30;
  pos = pos +  5*Font16.Width;

  switch(cc)
  {
  case CCNONE :
    GUI_DisplayStringAt(pos, 10+ Font16.Height, (uint8_t*)"    ", LEFT_MODE);
    break;
  case CC1 :
    GUI_DisplayStringAt(pos, 10+ Font16.Height, (uint8_t*)"CC1", LEFT_MODE);
    break;
  case CC2 :
    GUI_DisplayStringAt(pos, 10+ Font16.Height, (uint8_t*)"CC2", LEFT_MODE);
    break;
  }
}

/**
  * @brief  Display border
  * @retval None
  */
static void Display_border(void)
{
  GUI_SetBackColor(GUI_COLOR_CYAN);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);

  GUI_DrawLine(0, 5 * Font12.Height, 320, 5 * Font12.Height, GUI_COLOR_ST_BLUE_DARK);
  GUI_DrawLine(0, 16 * Font12.Height -1, 320, 16 * Font12.Height - 1, GUI_COLOR_ST_BLUE_DARK);
  GUI_DrawLine(160, 16 * Font12.Height - 1, 160, 240, GUI_COLOR_ST_BLUE_DARK);
}

/**
  * @brief  Display clear info
  * @retval None
  */
static void Display_clear_info(void)
{
  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_WHITE);
  GUI_SetFont(&Font12);

  /* Fill a blank rectangle to clear the display information panel */
  GUI_FillRect(0, LINE(6), 320, 9*Font12.Height, GUI_COLOR_WHITE);
}

/**
  * @brief  Display build info
  * @retval None
  */
static void Display_build_info(void)
{
  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  GUI_DisplayStringAt(0, 1 + (5 * Font16.Height), (uint8_t*)"USBPD Demo for", CENTER_MODE);
  GUI_DisplayStringAt(0, 1 + (6 * Font16.Height), (uint8_t*)"STM32L552E-EVAL", CENTER_MODE);
#if defined(_GUI_INTERFACE) && defined(_TRACE)
  GUI_DisplayStringAt(0, 1 + (8 * Font16.Height), (uint8_t*)"GUI TRACE", CENTER_MODE);
#elif defined(_GUI_INTERFACE) && !defined(_TRACE)
  GUI_DisplayStringAt(0, 1 + (8 * Font16.Height), (uint8_t*)"GUI", CENTER_MODE);
#elif !defined(_GUI_INTERFACE) && defined(_TRACE)
  GUI_DisplayStringAt(0, 1 + (8 * Font16.Height), (uint8_t*)"TRACE", CENTER_MODE);
#else /* TRACE */
  //GUI_DisplayStringAt(0, 1 + (8 * Font16.Height), (uint8_t*)"GUI", CENTER_MODE);
#endif
#ifdef _VDM
  GUI_DisplayStringAt(0, 1 + (9 * Font16.Height), (uint8_t*)"VDM", CENTER_MODE);
#endif

  char tab[26] = {0};
  sprintf(tab,"FW:%6x-STACK:%8x", USBPD_FW_VERSION, _LIB_ID);
  GUI_DisplayStringAt(0, 1 + (10 * Font16.Height), (uint8_t*)tab, CENTER_MODE);
}

/**
  * @brief  Menu selection managment
  * @param  PortNum     The handle of the port
  * @param  IndexMax    MAX index
  * @param  LineMax     MAX line
  * @param  Start       Pointer on Start
  * @param  End         Pointer on end
  * @param  Orientation Orientation
  * @retval None
  */
static void Menu_manage_selection(uint8_t PortNum, uint8_t IndexMax, uint8_t LineMax, uint8_t *Start, uint8_t *End, int8_t Orientation)
{
  *Start = 0;
  *End   = *Start + LineMax;

  if(( Orientation == 0 ) || (IndexMax == 0))
  {
    *Start = 0;
    *End =(LineMax > IndexMax)? IndexMax: LineMax;
    g_tab_menu_pos[PortNum] = g_tab_menu_sel[PortNum] = 0;
    return;
  }

  if( -1 == Orientation)
  {
    if(0 == g_tab_menu_sel[PortNum])
    {
      /* got at the end of the selection */
      g_tab_menu_pos[PortNum] = LineMax > IndexMax? IndexMax-1: LineMax-1;
      g_tab_menu_sel[PortNum] = IndexMax-1;
      *End = IndexMax;
      if( IndexMax > LineMax ) {
        *Start = IndexMax - LineMax;
      } else {
        *Start = 0;
      }
    }
    else
    {
      if(0 == g_tab_menu_pos[PortNum])
      {
        g_tab_menu_sel[PortNum]--;
        *Start =  g_tab_menu_sel[PortNum];
        if(IndexMax > LineMax )
          *End = *Start + LineMax;
        else
          *End = *Start + IndexMax;
      }
      else
      {
      *Start = g_tab_menu_sel[PortNum] - g_tab_menu_pos[PortNum];
      if(IndexMax > LineMax )
        *End   = g_tab_menu_sel[PortNum] + LineMax - g_tab_menu_pos[PortNum];
      else
        *End   = g_tab_menu_sel[PortNum] + IndexMax - g_tab_menu_pos[PortNum];

