STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/demo_application.c
      g_tab_menu_pos[PortNum]--;
      g_tab_menu_sel[PortNum]--;
      }
    }
  }
  else  /* +1 == orientation */
  {
    if(((LineMax-1) == g_tab_menu_pos[PortNum]) || (((IndexMax-1) == g_tab_menu_pos[PortNum]) && (LineMax >= IndexMax)))
    {      /* at the end of selection, so two case there is others data or at the end of the data */
      if(g_tab_menu_sel[PortNum] == (IndexMax-1))
      {
        /* restart at the begin of the list */
        g_tab_menu_pos[PortNum] = 0;
        g_tab_menu_sel[PortNum] = 0;
        *Start = 0;
        *End   = LineMax > IndexMax? IndexMax : LineMax;
      }
      else
      {
        *Start = g_tab_menu_sel[PortNum] - (LineMax-1) + 1;
        *End = *Start+LineMax;
        g_tab_menu_sel[PortNum]++;
      }
    }
    else
    {
      *Start = g_tab_menu_sel[PortNum] - g_tab_menu_pos[PortNum];
      if(IndexMax > LineMax)
        *End   = *Start + LineMax;
      else
        *End   = *Start + IndexMax;
      g_tab_menu_sel[PortNum]++;
      g_tab_menu_pos[PortNum]++;
    }
  }
}

/**
  * @brief  get next menu
  * @param  PortNum     The handle of the port
  * @param  MenuId      ID menu
  * @retval menuid
  */
static DEMO_MENU Menu_manage_next(uint8_t PortNum, uint8_t MenuId)
{
  return g_tab_menu_next[PortNum][MenuId];
}

/**
  * @brief  get prev menu
  * @param  PortNum     The handle of the port
  * @param  MenuId      ID menu
  * @param  MenuId
  * @retval menuid
  */
static DEMO_MENU Menu_manage_prev(uint8_t PortNum, uint8_t MenuId)
{
  return g_tab_menu_prev[PortNum][MenuId];
}

/**
  * @brief  cable info memu
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_cableinfo_menu(uint8_t PortNum)
{
  uint8_t str[30];
  char *ss[4]        = {"2.0","GEN1","GEN1&2","NA  "};
  char *vbusc[4]     = {"NA","3A","5A","NA"};
  char *MaxVoltage[] = {"20V  ", "30V  ", "40V  ", "50V  "};
  char *Term[]    =    {"     ", "VCONN", "VCONN", "VCONN"};
  char *Latency[]    = {"<10ns", "<20ns", "<30ns", "<40ns",
                        "<50ns", "<60ns", "<70ns", ">70ns"
                        "1000 ", "2000 "};

  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  /* Display menu sink capa */
  GUI_DisplayStringAt(0, 1 + 6 * Font12.Height, (uint8_t *)"Cable information :", LEFT_MODE);

  if(pIdentity.CableVDO_Presence == 0)
  {
    sprintf((char *)str, "no information availble");
    GUI_DisplayStringAt(0, 1 + 8 * Font12.Height + Font16.Height , str, LEFT_MODE);
  }
  else
  {
    sprintf((char *)str, "USBSS: %s  VBUS cap:%s", ss[pIdentity.CableVDO.b.USB_SS_Support],vbusc[pIdentity.CableVDO.b.VBUS_CurrentHandCap]);
    GUI_DisplayStringAt(0, 1 + 7 * Font12.Height + Font16.Height , str, LEFT_MODE);
    sprintf((char *)str, "Max V: %s  TType:%s", MaxVoltage[pIdentity.CableVDO.b.CableMaxVoltage], Term[pIdentity.CableVDO.b.CableTermType]);
    GUI_DisplayStringAt(0, 1 + 8 * Font12.Height + Font16.Height , str, LEFT_MODE);
    sprintf((char *)str, "Laten; %s CableType:0x%x", Latency[pIdentity.CableVDO.b.CableLatency],pIdentity.CableVDO.b.CableToType);
    GUI_DisplayStringAt(0, 1 + 9 * Font12.Height + Font16.Height , str, LEFT_MODE);
    sprintf((char *)str, "VDO:0x%x FW:0x%x  HW:0x%x", pIdentity.CableVDO.b.VDO_Version,pIdentity.CableVDO.b.CableFWVersion,pIdentity.CableVDO.b.CableHWVersion );
    GUI_DisplayStringAt(0, 1 + 10 * Font12.Height + Font16.Height , str, LEFT_MODE);
  }
}

/**
  * @brief  snk capa menu display
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_sinkcapa_menu(uint8_t PortNum)
{
  uint8_t str[32];

  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  /* Display menu sink capa */
  GUI_DisplayStringAt(0, 1 + 6 * Font12.Height, (uint8_t *)"Sink capa :", LEFT_MODE);

  GUI_SetFont(&Font12);
  sprintf((char *)str, "FRS  DRD  USB  EPW  HCPA  DRP ");
#if defined(USBPD_REV30_SUPPORT)
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_FRS_SUPPORT_Msk)           str[3] = '*';
#endif
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_DRD_SUPPORT_Msk)           str[8] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_USBCOMM_Msk)               str[13] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_EXT_POWER_Msk)             str[18] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_HIGHERCAPAB_Msk)           str[24] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_DRP_SUPPORT_Msk)           str[29] = '*';
  GUI_DisplayStringAt(0, 1 + 6 * Font12.Height + Font16.Height , str, LEFT_MODE);

  Display_sinkcapa_menu_nav(PortNum, 0);
}

/**
  * @brief  snk capa menu navigation
  * @param  PortNum     The handle of the port
  * @param  Nav         Navigation
  * @retval None
  */
static void Display_sinkcapa_menu_nav(uint8_t PortNum, int8_t Nav)
{
  uint8_t _str[30];
  uint8_t _max = DPM_Ports[portSel].DPM_NumberOfRcvSNKPDO;
  uint8_t _start, _end;

  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  Menu_manage_selection(PortNum, _max, MAX_LINE_PDO, &_start, &_end, Nav);

  for(int8_t index=_start; index < _end; index++)
  {
    switch((uint32_t)((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_TYPE_Msk) >> USBPD_PDO_TYPE_Pos))
    {
    case USBPD_CORE_PDO_TYPE_FIXED :
      {
        uint32_t maxcurrent = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_FIXED_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_FIXED_MAX_CURRENT_Pos)*10;
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_FIXED_VOLTAGE_Msk) >> USBPD_PDO_SRC_FIXED_VOLTAGE_Pos)*50;
        sprintf((char*)_str, " FIXED:       %2luV %2lu.%luA", (unsigned long)(maxvoltage/1000), (unsigned long)(maxcurrent/1000), (unsigned long)(maxcurrent % 1000) /100);
      }
      break;
    case USBPD_CORE_PDO_TYPE_BATTERY :
      {
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_BATTERY_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_BATTERY_MAX_VOLTAGE_Pos) * 50;
        uint32_t minvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_BATTERY_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_BATTERY_MIN_VOLTAGE_Pos) * 50;
        uint32_t maxpower = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_BATTERY_MAX_POWER_Msk) >> USBPD_PDO_SRC_BATTERY_MAX_POWER_Pos) * 250;
        sprintf((char*)_str, " BATT:%2lu.%1lu-%2lu.%1luV %2lu.%luW", (unsigned long)(minvoltage/1000), (unsigned long)(minvoltage/100)%10, (unsigned long)(maxvoltage/1000), (unsigned long)(maxvoltage/100)%10, (unsigned long)(maxpower/1000), (unsigned long)(maxpower%1000)/100);
      }
      break;
    case USBPD_CORE_PDO_TYPE_VARIABLE :
      {
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_VARIABLE_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_VARIABLE_MAX_VOLTAGE_Pos) * 50;
        uint32_t minvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_VARIABLE_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_VARIABLE_MIN_VOLTAGE_Pos) * 50;
        uint32_t maxcurrent = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_VARIABLE_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_VARIABLE_MAX_CURRENT_Pos) * 10;
        sprintf((char*)_str, " VAR: %2lu.%1lu-%2lu.%1luV %2lu.%luA ", (unsigned long)(minvoltage/1000), (unsigned long)(minvoltage/100)%10, (unsigned long)(maxvoltage/1000), (unsigned long)(maxvoltage/100)%10, (unsigned long)(maxcurrent/1000), (unsigned long)((maxcurrent % 1000) /100));
      }
      break;
#if _PPS
    case USBPD_CORE_PDO_TYPE_APDO :
      {
        uint32_t minvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_APDO_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_APDO_MIN_VOLTAGE_Pos) * 100;
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_APDO_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_APDO_MAX_VOLTAGE_Pos) * 100;
        uint32_t maxcurrent = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_APDO_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_APDO_MAX_CURRENT_Pos) * 50;
        sprintf((char*)_str, " APDO:%2lu.%1lu-%2lu.%1luV %2lu.%luA ", (unsigned long)(minvoltage/1000), (unsigned long)(minvoltage/100)%10, (unsigned long)(maxvoltage/1000), (unsigned long)(maxvoltage/100)%10, (unsigned long)(maxcurrent/1000), (unsigned long)((maxcurrent % 1000) /100));
      }
      break;
#endif /* _PPS */
    default :
      sprintf((char*)_str,"Not yet managed by demo");
      break;
    }

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      GUI_SetBackColor(GUI_COLOR_ST_PINK);
      GUI_SetTextColor(GUI_COLOR_WHITE);
    }
    string_completion(_str, sizeof(_str));
    GUI_DisplayStringAt(0, 1 + 8 * Font12.Height  + (index + 1 - _start) * Font16.Height,  (uint8_t*)_str, CENTER_MODE);

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      GUI_SetBackColor(GUI_COLOR_WHITE);
      GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
    }
  }
}

/**
  * @brief  src capa menu display
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_sourcecapa_menu(uint8_t PortNum)
{
  uint8_t str[32];

  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  /* Display menu source capa */
  sprintf((char *)str, "Source capa : %lu", (unsigned long)DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO);
  GUI_DisplayStringAt(0, 1 + 6 * Font12.Height, str, LEFT_MODE);

