STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/demo_application.c
#ifdef USBPD_REV30_SUPPORT
/**
  * @brief  ext capa menu display
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_extcapa_menu(uint8_t PortNum)
{
  uint8_t str[30];

  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  /* Display menu source capa */
  sprintf((char *)str, "Extended capa : ");
  GUI_DisplayStringAt(0, 1 + 6 * Font12.Height, str, LEFT_MODE);

  Display_extcapa_menu_nav(PortNum, 0);
}

/**
  * @brief  ext capa menu navigation
  * @param  PortNum     The handle of the port
  * @param  Orientation Orientation
  * @retval None
  */
static void Display_extcapa_menu_nav(uint8_t PortNum, int8_t Orientation)
{
#if _SRC_CAPA_EXT
  uint8_t _str[16][20];
  uint8_t _max = 16;  /* Nb field inside extended capa */
  uint8_t _start, _end;

  memset(_str, ' ', sizeof(_str));

  sprintf((char *)_str[0], "VID:0x%x",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.VID);
  sprintf((char *)_str[1], "PID:0x%x",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PID);
  sprintf((char *)_str[2], "XID:0x%x",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.XID);
  sprintf((char *)_str[3], "F rev:0x%x",    DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.FW_revision);
  sprintf((char *)_str[4], "H rev:0x%x",    DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.HW_revision);
  sprintf((char *)_str[5], "V reg:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Voltage_regulation);
  sprintf((char *)_str[6], "Htime:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Holdup_time);
  sprintf((char *)_str[7], "Compliance:%d", DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Compliance);
  sprintf((char *)_str[8], "Tcurre:%d",     DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.TouchCurrent);
  sprintf((char *)_str[9], "Peak1:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PeakCurrent1);
  sprintf((char *)_str[10],"Peak2:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PeakCurrent2);
  sprintf((char *)_str[11],"Peak3:%d" ,     DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PeakCurrent3);
  sprintf((char *)_str[12],"Ttemp:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Touchtemp);
  sprintf((char *)_str[13],"SRCin:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Source_inputs);
  sprintf((char *)_str[14],"Nbbatt:%d",     DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.NbBatteries);
  sprintf((char *)_str[15],"PDP:%d",        DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.SourcePDP);

  for(int8_t i = 0; i < _max; i++)
  {
    uint8_t _size = strlen((char *)_str[i]);
    if(_size < 19 )
    {
      _str[i][_size] = ' ';
      _str[i][19] = '\0';
    }
  }

  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  Menu_manage_selection(PortNum, _max, MAX_LINE_EXTCAPA, &_start, &_end, Orientation);

  for(int8_t index=_start; index < _end; index++)
  {
    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      GUI_SetBackColor(GUI_COLOR_ST_PINK);
      GUI_SetTextColor(GUI_COLOR_WHITE);
    }

    GUI_DisplayStringAt(0, 1 + 6 * Font12.Height  + (index + 1 - _start) * Font16.Height,  (uint8_t*)_str[index], CENTER_MODE);

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      GUI_SetBackColor(GUI_COLOR_WHITE);
      GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
    }
  }
#endif /* _SRC_CAPA_EXT */
}

/**
  * @brief  Sink ext capa menu display
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_sinkextcapa_menu(uint8_t PortNum)
{
  uint8_t str[30];

  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  /* Display menu source capa */
  sprintf((char *)str, "Sink Extended capa : ");
  GUI_DisplayStringAt(0, 1 + 6 * Font12.Height, str, LEFT_MODE);

  Display_sinkextcapa_menu_nav(PortNum, 0);
}

/**
  * @brief  Sink ext capa menu navigation
  * @param  PortNum     The handle of the port
  * @param  Orientation Orientation
  * @retval None
  */
static void Display_sinkextcapa_menu_nav(uint8_t PortNum, int8_t Orientation)
{
  uint8_t _str[15][20];
  uint8_t _max = 15;  /* Nb field inside sink extended capa */
  uint8_t _start, _end;

  memset(_str, ' ', sizeof(_str));

  sprintf((char *)_str[0],  "VID:0x%x",            DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.VID);
  sprintf((char *)_str[1],  "PID:0x%x",            DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.PID);
  sprintf((char *)_str[2],  "XID:0x%lu",           (unsigned long)DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.XID);
  sprintf((char *)_str[3],  "F rev:0x%x",          DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.FW_revision);
  sprintf((char *)_str[4],  "H rev:0x%x",          DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.HW_revision);
  sprintf((char *)_str[5],  "SKEDB_Ver:0x%x",      DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.SKEDB_Version);
  sprintf((char *)_str[6],  "LoadStep:0x%x",       DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.LoadStep);
  sprintf((char *)_str[7],  "SinkLoadCharac:0x%x", DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.SinkLoadCharac.Value);
  sprintf((char *)_str[8],  "Compliance:%d",       DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.Compliance);
  sprintf((char *)_str[9],  "Ttemp:%d",            DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.Touchtemp);
  sprintf((char *)_str[10], "BatteryInfo:0x%x",    DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.BatteryInfo);
  sprintf((char *)_str[11], "SinkModes:0x%x",      DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.SinkModes);
  sprintf((char *)_str[12], "SinkMinPDP:%d",       DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.SinkMinimumPDP);
  sprintf((char *)_str[13], "SinkOpePDP:%d",       DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.SinkOperationalPDP);
  sprintf((char *)_str[14], "SinkMaxPDP:%d",       DPM_Ports[PortNum].DPM_RcvSNKExtendedCapa.SinkMaximumPDP);

  for(int8_t i = 0; i < _max; i++)
  {
    uint8_t _size = strlen((char *)_str[i]);
    if(_size < 19 )
    {
      _str[i][_size] = ' ';
      _str[i][19] = '\0';
    }
  }

  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  GUI_SetFont(&Font16);

  Menu_manage_selection(PortNum, _max, MAX_LINE_EXTCAPA, &_start, &_end, Orientation);

  for(int8_t index=_start; index < _end; index++)
  {
    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      GUI_SetBackColor(GUI_COLOR_ST_PINK);
      GUI_SetTextColor(GUI_COLOR_WHITE);
    }

