STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/demo_application.c
  GUI_SetFont(&Font12);
  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_PURPLE);

  pos = (PortNum == 0)? 0:160;
  pos = pos + 5;

  /* move line 2 inside 1 */
  strncpy((char*)TxtMessage[PortNum][0], (char*)TxtMessage[PortNum][1], 21);
  strncpy((char*)TxtMessage[PortNum][1], (char*)TxtMessage[PortNum][2], 21);
  /* move line 3 inside 2 */
  strncpy((char*)TxtMessage[PortNum][2], (char*)TxtMessage[PortNum][3], 21);
  /* move line enter inside line 3 */
  memset(TxtMessage[PortNum][3], 0, 20*sizeof(uint8_t));
  sprintf((char*)TxtMessage[PortNum][3], "%21s", msg);

  for(uint8_t index = 0; index < 4; index++)
  {
    GUI_DisplayStringAt(pos, (index + 16) * Font12.Height, TxtMessage[PortNum][index], LEFT_MODE);
  }
}

/**
  * @brief  main demo function to manage all the appplication event and to update MMI
  * @retval None
  */
static void Display_Selected_port(void)
{
#if (USBPD_PORT_COUNT > 1)
  char pstr[20]={0};
#endif /* USBPD_PORT_COUNT > 1 */
  GUI_SetFont(&Font16);

  if (portSel == 0)
  {
    GUI_SetBackColor(GUI_COLOR_ST_PINK);
    GUI_SetTextColor(GUI_COLOR_WHITE);
  }
  else
  {
    GUI_SetBackColor(GUI_COLOR_WHITE);
    GUI_SetTextColor(GUI_COLOR_ST_BLUE_DARK);
  }

  /* Port 0 */
  if(DPM_Ports[0].DPM_IsConnected)
  {
    if (USBPD_PORTPOWERROLE_SRC == DPM_Params[0].PE_PowerRole)
      GUI_DisplayStringAt(54 + Font16.Width , 10, (uint8_t*)"P1:SRC", LEFT_MODE);
    else
      GUI_DisplayStringAt(54 + Font16.Width , 10, (uint8_t*)"P1:SNK", LEFT_MODE);
  }
  else
  {
    if(USBPD_TRUE == DPM_Settings[0].CAD_RoleToggle)
    {
      GUI_DisplayStringAt(54 + Font16.Width, 10, (uint8_t*)"P1:DRP", LEFT_MODE);
    }
    else
    {
      if (USBPD_PORTPOWERROLE_SRC == DPM_Settings[0].PE_DefaultRole)
        GUI_DisplayStringAt(54 + Font16.Width , 10, (uint8_t*)"P1:SRC", LEFT_MODE);
      else
        GUI_DisplayStringAt(54 + Font16.Width , 10, (uint8_t*)"P1:SNK", LEFT_MODE);
    }
  }
}

/**
  * @brief  main demo function to manage all the appplication event and to update MMI
  * @param  Event Event value
  * @retval None
  */
static void DEMO_Manage_event(uint32_t Event)
{
  static DEMO_MENU _tab_menu_val[2] = { MENU_EMPTY, MENU_EMPTY};
  static uint8_t   _tab_connect_status[2] = { 0, 0};

  switch(Event & DEMO_MSG_TYPE_MSK)
  {
  case DEMO_MSG_MMI:
    {
      switch(Event & DEMO_MMI_ACTION_Msk)
      {
      case DEMO_MMI_ACTION_NONE:
        Display_power();
        return;
      case DEMO_MMI_ACTION_USER_PRESS:     /* change the selected default port */
        Display_menuupdate_info(portSel,_tab_menu_val[portSel]);
        break;
      case  DEMO_MMI_ACTION_RIGHT_PRESS:
        _tab_menu_val[portSel] = Menu_manage_next(portSel, _tab_menu_val[portSel]);
        Display_menuupdate_info(portSel,_tab_menu_val[portSel]);
        break;
      case  DEMO_MMI_ACTION_LEFT_PRESS:
        _tab_menu_val[portSel] = Menu_manage_prev(portSel, _tab_menu_val[portSel]);
        Display_menuupdate_info(portSel,_tab_menu_val[portSel]);
        break;
      case  DEMO_MMI_ACTION_UP_PRESS:       /* up /down */
        Display_menunav_info(portSel, _tab_menu_val[portSel], -1);
        break;
      case  DEMO_MMI_ACTION_DOWN_PRESS:
        Display_menunav_info(portSel, _tab_menu_val[portSel], +1);
        break;
      case DEMO_MMI_ACTION_SEL_PRESS :
        Display_menuexec_info(portSel, _tab_menu_val[portSel]);
#if defined(_RTOS)
        /* delay add to avoid multiple press event */
        osDelay(100);
#endif /* _RTOS */
        break;
      case DEMO_MMI_ACTION_ERROR_POWER :
        DEMO_Display_Error(portSel, DEMO_ERROR_TYPE_POWER);
        break;
      }
    }
    break;
  case DEMO_MSG_CAD :
    {
       uint8_t _portnum = (Event &  DEMO_CAD_PORT_NUM_Msk) >> DEMO_CAD_PORT_NUM_Pos;
       uint8_t _cc = (Event &  DEMO_CAD_CC_NUM_Msk) >> DEMO_CAD_CC_NUM_Pos;
       Display_cc_port(_portnum, (CCxPin_TypeDef)_cc);

       switch((Event & DEMO_CAD_STATE_Msk)>> DEMO_CAD_STATE_Pos)
       {
       case USBPD_CAD_EVENT_ATTEMC :
         _tab_connect_status[_portnum] = 1;
         Display_debug_port(_portnum, (uint8_t *)"attach emc");
         break;
       case USBPD_CAD_EVENT_ATTACHED :
         _tab_connect_status[_portnum] = 1;
         Display_debug_port(_portnum, (uint8_t *)"attach");
           break;
       case USBPD_CAD_EVENT_DETACHED :

         /* Reset cable information : vconn availble only for port 0 */
         if (_portnum == 0 )
         {
           pIdentity.CableVDO_Presence = 0;
         }

         _tab_connect_status[_portnum] = 0;
         _tab_menu_val[_portnum] = MENU_EMPTY;
         Display_contract_port(_portnum);
         Display_power();
         Display_debug_port(_portnum, (uint8_t *)"detach");
         if(portSel == _portnum) Display_menuupdate_info(_portnum, _tab_menu_val[_portnum]);
         break;
       }
    }
    break;
  case DEMO_MSG_PENOTIFY :
    {
      uint8_t _portnum = (Event &  DEMO_PE_PORT_NUM_Msk) >> DEMO_PE_PORT_NUM_Pos;

      switch((Event & DEMO_PE_STATE_Msk)>> DEMO_PE_STATE_Pos)
      {
      case USBPD_NOTIFY_POWER_EXPLICIT_CONTRACT :
        Display_Selected_port();
        Display_contract_port(_portnum);
        Display_power();
        Display_debug_port(_portnum, (uint8_t *)"Explicit contract");

        if (_tab_connect_status[_portnum] == 1)
        {
          if (DPM_Params[_portnum].PE_PowerRole == USBPD_PORTPOWERROLE_SNK)
            _tab_menu_val[_portnum] = MENU_SOURCECAPA_RECEIVED;
          else
            _tab_menu_val[_portnum] = MENU_COMMAND;

          if(_portnum == portSel)
          {
            Display_menuupdate_info(_portnum, _tab_menu_val[_portnum]);
          }

          _tab_connect_status[_portnum] = 2;
        }
        break;
      case USBPD_NOTIFY_HARDRESET_TX :
        Display_debug_port(_portnum, (uint8_t *)"send hardreset");
        break;
      case USBPD_NOTIFY_HARDRESET_RX :
        Display_debug_port(_portnum, (uint8_t *)"receive hardreset");
        break;
      case USBPD_NOTIFY_SNK_GOTOMIN :
        Display_debug_port(_portnum, (uint8_t *)"receive gotomin");
        break;
      case USBPD_NOTIFY_SNK_GOTOMIN_READY :
        Display_debug_port(_portnum, (uint8_t *)"receive gotomin ready");
        break;
      case USBPD_NOTIFY_SOFTRESET_RECEIVED :
        Display_debug_port(_portnum, (uint8_t *)"receive soft reset");
        break;
      case USBPD_NOTIFY_PING_RECEIVED :
        Display_debug_port(_portnum, (uint8_t *)"receive ping");
        break;
      case USBPD_NOTIFY_GETSRCCAP_ACCEPTED :
        Display_debug_port(_portnum, (uint8_t *)"receive source capa");
        break;
      case USBPD_NOTIFY_GETSRCCAP_REJECTED :
        Display_debug_port(_portnum, (uint8_t *)"reject source capa");
        break;
      case USBPD_NOTIFY_GETSNKCAP_TIMEOUT :
        Display_debug_port(_portnum, (uint8_t *)"timeout source capa");
        break;
      case USBPD_NOTIFY_REQUEST_ACCEPTED :
        Display_debug_port(_portnum, (uint8_t *)"request accepted");
        break;
      case USBPD_NOTIFY_REQUEST_REJECTED :
        Display_debug_port(_portnum, (uint8_t *)"request rejected");
        break;
      case USBPD_NOTIFY_REQUEST_WAIT :
        Display_debug_port(_portnum, (uint8_t *)"request wait");
        break;
      case USBPD_NOTIFY_REQUEST_GOTOMIN :
        Display_debug_port(_portnum, (uint8_t *)"request gotomin");
        break;
      case USBPD_NOTIFY_POWER_SWAP_TO_SNK_DONE :
        Display_debug_port(_portnum, (uint8_t *)"swap SNK done");
        break;
      case USBPD_NOTIFY_POWER_SWAP_TO_SRC_DONE :
        Display_debug_port(_portnum, (uint8_t *)"swap SRC done");
        break;
      case USBPD_NOTIFY_POWER_SWAP_REJ :
        Display_debug_port(_portnum, (uint8_t *)"power swap reject");
        break;
      case USBPD_NOTIFY_DATAROLESWAP_UFP:
      case USBPD_NOTIFY_DATAROLESWAP_DFP:
        Display_contract_port(_portnum);
      break;
      case USBPD_NOTIFY_REQUEST_ENTER_MODE :
        Display_debug_port(_portnum, (uint8_t *)"send vdm enter mode");
        break;
      case USBPD_NOTIFY_REQUEST_ENTER_MODE_ACK :
        Display_debug_port(_portnum, (uint8_t *)"vdm enter mode ACK");
        break;
      case USBPD_NOTIFY_REQUEST_ENTER_MODE_NAK :
        Display_debug_port(_portnum, (uint8_t *)"vdm enter mode NAK");
        break;
      case USBPD_NOTIFY_REQUEST_ENTER_MODE_BUSY :
        Display_debug_port(_portnum, (uint8_t *)"vdm enter mode BSY");
        break;
      case USBPD_NOTIFY_GET_SNK_CAP_EXT_RECEIVED :
        Display_debug_port(_portnum, (uint8_t *)"rec get SNK cap ext");
        break;
      case USBPD_NOTIFY_SNK_CAP_EXT_SENT :
        Display_debug_port(_portnum, (uint8_t *)"SNK capa ext sent");
        break;
      case USBPD_NOTIFY_SNK_CAP_EXT_RECEIVED :
        Display_debug_port(_portnum, (uint8_t *)"rec SNK cap ext");
        break;
      }
    }
    break;

