STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/demo_application.c
  }
  Display_Selected_port();
}

/**
  * @brief  demo task function
  * @param  queue_id ID of the queue
  * @retval None
  */
#if (osCMSIS < 0x20000U)
static void DEMO_Task(void const *queue_id)
#else
static void DEMO_Task(void *queue_id)
#endif
{
#if defined(_RTOS)
  osMessageQId  queue = *(osMessageQId *)queue_id;
#endif

  Display_build_info();

  for (;;)
  {
#if defined(_RTOS)
#if (osCMSIS < 0x20000U)
    osEvent event = osMessageGet(queue, 1000);
    DEMO_Manage_event(DEMO_MSG_MMI | DEMO_MMI_ACTION_NONE);
    if(osEventMessage == event.status)
    {
      DEMO_Manage_event(event.value.v);
      /* Debounce */
      osDelay(200);
      joyevent = 0;
    }
#else
    osStatus_t status;
    uint32_t event;
    status = osMessageQueueGet(queue, &event, NULL, 1000);
    DEMO_Manage_event(DEMO_MSG_MMI | DEMO_MMI_ACTION_NONE);
    if (status == osOK)
    {
      DEMO_Manage_event(event);
      /* Debounce */
      osDelay(200);
      joyevent = 0;
    }
#endif /* osCMSIS < 0x20000U */
#endif /* _RTOS */
  }
}

/**
  * @brief  strin completion add space to fit the string size
  * @param  Str       Pointer on the string
  * @param  SizeMax   Max size of the string
  * @retval None
  */
static void string_completion(uint8_t *Str, uint8_t SizeMax)
{
  uint8_t size = strlen((char *)Str);

  if(size > SizeMax) Str[SizeMax] = '\0';
  else
  {
    /* add space */
    for(uint8_t index = size; index < SizeMax; index++)
    {
      Str[index] = ' ';
    }
    Str[SizeMax] = '\0';
  }
}

void vApplicationStackOverflowHook( TaskHandle_t xTask,
                                    signed char *pcTaskName );
void vApplicationStackOverflowHook( TaskHandle_t xTask,
                                    signed char *pcTaskName )
{
  while(1);
}

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
